


Network Working Group                                         A. Muhanna
Internet-Draft                                                 M. Khalil
Intended status: Standards Track                                  Nortel
Expires: February 16, 2010                                 S. Gundavelli
                                                           Cisco Systems
                                                            K. Chowdhury
                                                        Starent Networks
                                                               P. Yegani
                                                        Juniper Networks
                                                         August 15, 2009


                  Binding Revocation for IPv6 Mobility
               draft-ietf-mext-binding-revocation-09.txt

Status of this Memo

   This Internet-Draft is submitted to IETF in full conformance with the
   provisions of BCP 78 and BCP 79.  This document may contain material
   from IETF Documents or IETF Contributions published or made publicly
   available before November 10, 2008.  The person(s) controlling the
   copyright in some of this material may not have granted the IETF
   Trust the right to allow modifications of such material outside the
   IETF Standards Process.  Without obtaining an adequate license from
   the person(s) controlling the copyright in such materials, this
   document may not be modified outside the IETF Standards Process, and
   derivative works of it may not be created outside the IETF Standards
   Process, except to format it for publication as an RFC or to
   translate it into languages other than English.

   Internet-Drafts are working documents of the Internet Engineering
   Task Force (IETF), its areas, and its working groups.  Note that
   other groups may also distribute working documents as Internet-
   Drafts.

   Internet-Drafts are draft documents valid for a maximum of six months
   and may be updated, replaced, or obsoleted by other documents at any
   time.  It is inappropriate to use Internet-Drafts as reference
   material or to cite them other than as "work in progress."

   The list of current Internet-Drafts can be accessed at
   http://www.ietf.org/ietf/1id-abstracts.txt.

   The list of Internet-Draft Shadow Directories can be accessed at
   http://www.ietf.org/shadow.html.

   This Internet-Draft will expire on February 16, 2010.




Muhanna, et al.         Expires February 16, 2010               [Page 1]

Internet-Draft    Binding Revocation for IPv6 Mobility       August 2009


Copyright Notice

   Copyright (c) 2009 IETF Trust and the persons identified as the
   document authors.  All rights reserved.

   This document is subject to BCP 78 and the IETF Trust's Legal
   Provisions Relating to IETF Documents in effect on the date of
   publication of this document (http://trustee.ietf.org/license-info).
   Please review these documents carefully, as they describe your rights
   and restrictions with respect to this document.

Abstract

   This document defines a binding revocation mechanism to terminate a
   mobile node's mobility session and the associated resources.  These
   semantics are generic enough and can be used by mobility entities in
   the case of Mobile IPv6 and its extensions.  This mechanism allows
   the mobility entity which initiates the revocation procedure to
   request its corresponding one to terminate either one, multiple or
   all specified binding cache entries.































Muhanna, et al.         Expires February 16, 2010               [Page 2]

Internet-Draft    Binding Revocation for IPv6 Mobility       August 2009


Table of Contents

   1.  Introduction . . . . . . . . . . . . . . . . . . . . . . . . .  5
   2.  Conventions & Terminology  . . . . . . . . . . . . . . . . . .  5
     2.1.  Conventions used in this document  . . . . . . . . . . . .  5
     2.2.  Terminology  . . . . . . . . . . . . . . . . . . . . . . .  5
   3.  Binding Revocation Protocol and Use Cases Overview . . . . . .  5
     3.1.  Binding Revocation Protocol  . . . . . . . . . . . . . . .  6
     3.2.  MIPv6 and DSMIP6 Use Case  . . . . . . . . . . . . . . . .  7
     3.3.  Multi-Care of Addresses (Monami6) Use Case . . . . . . . .  8
     3.4.  Proxy MIPv6 Use Case . . . . . . . . . . . . . . . . . . .  9
       3.4.1.  Local Mobility Anchor Initiates PMIPv6 Binding
               Revocation . . . . . . . . . . . . . . . . . . . . . . 10
       3.4.2.  Mobile Access Gateway Revokes Bulk PMIPv6 Bindings . . 11
   4.  Security Model . . . . . . . . . . . . . . . . . . . . . . . . 12
   5.  Binding Revocation Messages over IPv4 Transport Network  . . . 12
   6.  Binding Revocation Message . . . . . . . . . . . . . . . . . . 13
     6.1.  Binding Revocation Indication Message  . . . . . . . . . . 14
     6.2.  Binding Revocation Acknowledgement Message . . . . . . . . 17
   7.  Binding Revocation Process Operation . . . . . . . . . . . . . 20
     7.1.  Sending Binding Revocation Messages  . . . . . . . . . . . 20
     7.2.  Receiving Binding Revocation Messages  . . . . . . . . . . 21
     7.3.  Retransmission of Binding Revocation Indication  . . . . . 22
   8.  Home Agent Operation . . . . . . . . . . . . . . . . . . . . . 22
     8.1.  Sending Binding Revocation Indication  . . . . . . . . . . 22
     8.2.  Receiving Binding Revocation Acknowledgement . . . . . . . 24
   9.  Local Mobility Anchor Operation  . . . . . . . . . . . . . . . 24
     9.1.  Binding Revocation Initiator . . . . . . . . . . . . . . . 24
       9.1.1.  Sending Binding Revocation Indication  . . . . . . . . 24
       9.1.2.  Receiving Binding Revocation Acknowledgement . . . . . 28
     9.2.  Binding Revocation Responder . . . . . . . . . . . . . . . 29
       9.2.1.  Receiving Binding Revocation Indication  . . . . . . . 29
       9.2.2.  Sending Binding Revocation Acknowledgement . . . . . . 30
   10. Mobile Access Gateway Operation  . . . . . . . . . . . . . . . 31
     10.1. Binding Revocation Responder . . . . . . . . . . . . . . . 31
       10.1.1. Receiving Binding Revocation Indication  . . . . . . . 31
       10.1.2. Sending Binding Revocation Acknowledgement . . . . . . 33
     10.2. Binding Revocation Initiator . . . . . . . . . . . . . . . 34
       10.2.1. Sending Binding Revocation Indication  . . . . . . . . 34
       10.2.2. Receiving Binding Revocation Acknowledgement . . . . . 35
   11. Mobile Node Operation  . . . . . . . . . . . . . . . . . . . . 35
     11.1. Receiving Binding Revocation Indication  . . . . . . . . . 35
     11.2. Sending Binding Revocation Acknowledgement . . . . . . . . 37
   12. Protocol Configuration Variables . . . . . . . . . . . . . . . 37
   13. IANA Considerations  . . . . . . . . . . . . . . . . . . . . . 38
   14. Security Considerations  . . . . . . . . . . . . . . . . . . . 39
   15. Acknowledgements . . . . . . . . . . . . . . . . . . . . . . . 40
   16. References . . . . . . . . . . . . . . . . . . . . . . . . . . 40



Muhanna, et al.         Expires February 16, 2010               [Page 3]

Internet-Draft    Binding Revocation for IPv6 Mobility       August 2009


     16.1. Normative References . . . . . . . . . . . . . . . . . . . 40
     16.2. Informative References . . . . . . . . . . . . . . . . . . 40
   Authors' Addresses . . . . . . . . . . . . . . . . . . . . . . . . 41
















































Muhanna, et al.         Expires February 16, 2010               [Page 4]

Internet-Draft    Binding Revocation for IPv6 Mobility       August 2009


1.  Introduction

   In the case of Mobile IPv6 and for administrative reason, sometimes
   it becomes necessary to inform the mobile node that its registration
   has been revoked and the mobile node is no longer able to receive IP
   mobility service using its Home Address.  A similar Mobile IPv4
   registration revocation mechanism [RFC3543] has been specified by
   IETF for providing a revocation mechanism for sessions that were
   established using Mobile IPv4 registration [RFC3344].

   This document specifies a binding revocation mechanism that can be
   used to revoke a mobile node's mobility session(s).  The same
   mechanism can be used to revoke bindings created using Mobile IPv6
   [RFC3775] or any of its extensions, e.g.  Proxy Mobile IPv6
   [RFC5213].  The proposed revocation mechanism uses a new MH type
   <IANA-TBD> for revocation signaling which is applicable to Mobile
   IPv6 [RFC3775] and Proxy Mobile IPv6 [RFC5213] and can be used by any
   two IP mobility entities.  As an example, this mechanism allows a
   local mobility anchor (LMA), involved in providing IP mobility
   services to a mobile node, to notify the mobile access gateway (MAG)
   of the termination of a mobile node binding registration.  In another
   example, a mobile access gateway can use this mechanism to notify its
   local mobility anchor peer with a bulk termination of all or a subset
   of proxy mobile IPv6 (PMIPv6) bindings that are registered with the
   local mobility anchor and currently being served by the mobile access
   gateway.


2.  Conventions & Terminology

2.1.  Conventions used in this document

   The key words "MUST", "MUST NOT", "REQUIRED", "SHALL", "SHALL NOT",
   "SHOULD", "SHOULD NOT", "RECOMMENDED", "MAY", and "OPTIONAL" in this
   document are to be interpreted as described in [RFC2119].

2.2.  Terminology

   All the general mobility related terminology and abbreviations are to
   be interpreted as defined in Mobile IPv6 [RFC3775] and Proxy Mobile
   IPv6 [RFC5213] specifications.


3.  Binding Revocation Protocol and Use Cases Overview

   This specification specifies a generic binding revocation mechanism
   where a mobility node can communicate to the mobile node or another
   mobility node the identity of the the mobile node registration



Muhanna, et al.         Expires February 16, 2010               [Page 5]

Internet-Draft    Binding Revocation for IPv6 Mobility       August 2009


   binding that is being terminated.  In the case when this mechanism is
   used for bulk termination or multiple bindings, the identities of
   these bindings are communicated to the mobile node or mobility node
   using the same generic mechanism.  The following subsections describe
   the protocol overview and applicable use cases.

3.1.  Binding Revocation Protocol

   In the case of Mobile IPv6, if the home network decides to terminate
   the service of the mobile node, the home agent sends a Binding
   Revocation Indication (BRI) message to the mobile node.  The home
   agent includes the home address (HoA) of the mobile node in the Type
   2 routing header as specified in [RFC3775] to indicate the impacted
   mobile node binding.  In the case of Dual Stack Mobile IPv6 (DSMIPv6)
   [RFC5555], the home agent may include the IPv4 Home Address option
   with the mobile node assigned home IPv4 address.  Additionally, if
   the mobile node registered multiple care-of addresses [ID-MCoA], the
   home agent includes the Binding Identifier (BID) option(s) in the
   Binding Revocation Indication message to identify which binding is
   being revoked.  When the mobile node receives a Binding Revocation
   Indication message with its HoA included in the Type 2 routing header
   and the Acknowledge (A) bit is set, the mobile node responds by
   sending a Binding Revocation Acknowledgement (BRA) message.

   Similarly, in the case of Proxy Mobile IPv6 [RFC5213], the revocation
   procedure can be initiated by the local mobility anchor by sending a
   Binding Revocation Indication message to communicate the termination
   of a mobile node registration binding to the mobile access gateway.
   In this case, the local mobility anchor includes the mobile node Home
   Network Prefix (MN-HNP) option [RFC5213] and the MN-ID option
   [RFC4283] to indicate to the mobility access gateway the identity of
   the PMIPv6 binding that needs to be terminated.  When the mobile
   access gateway receives the Binding Revocation Indication message
   with the Acknowledge (A) bit set, the mobile access gateway responds
   to the local mobility anchor by sending a Binding Revocation
   Acknowledgement message.

   On the other hand, the mobile access gateway usually sends a de-
   registration message by sending a Proxy Binding Update with a
   lifetime of zero to indicate to the local mobility anchor of the
   termination of the PMIPv6 mobile node binding registration.  In this
   case, the mobile access gateway includes the MN-HNP option, the MN-ID
   option and all other required mobility options as per [RFC5213] in
   order for the local mobility anchor to identify the mobile node
   PMIPv6 binding.  Additionally, in the case when the mobile access
   gateway communicates a bulk termination of PMIPv6 mobility sessions,
   the mobile access gateway sends a Binding Revocation Indication
   message with the Global (G) and Acknowledge (A) bits set and includes



Muhanna, et al.         Expires February 16, 2010               [Page 6]

Internet-Draft    Binding Revocation for IPv6 Mobility       August 2009


   the mobile access gateway identity in the MN-ID option.  When the
   local mobility anchor receives such Binding Revocation Indication
   message, it ensures that the mobile access gateway is authorized to
   send such bulk termination message and then processes the Binding
   Revocation Indication message accordingly.  If the local mobility
   anchor processes the Binding Revocation Indication message
   successfully, the local mobility anchor responds to the mobile access
   gateway by sending Binding Revocation Acknowledgement message.

   In any of the above cases, the initiator of the binding revocation
   procedure, e.g., home agent, local mobility anchor, mobile access
   gateway, uses the Revocation Trigger field in the Binding Revocation
   Indication message to indicate to the receiving node the reason for
   initiating the revocation procedure.

3.2.  MIPv6 and DSMIP6 Use Case

   Binding revocation mechanism is applicable to Mobile IPv6 and DSMIPv6
   session(s) when the home agent needs to inform the mobile node that
   its binding registration has been revoked, e.g. for an administrative
   reason.  This mechanism enables the user to react to the revocation,
   e.g., reinstate its interrupted Mobile IPv6 services.

   In this case, the home agent sends a Binding Revocation Indication
   message to indicate to the mobile node that its current mobile IPv6
   (MIPv6) binding has been revoked and it no longer able to receive IP
   mobility service.  The home agent includes the HoA in Type 2 routing
   header as used in [RFC3775] and sets the Revocation Trigger field to
   a proper value, e.g., Administrative Reason.  In the case of DSMIPv6
   session, the home agent may additionally include the mobile node
   assigned IPv4 Home Address in the IPv4 Home Address option.  When the
   mobile node receives the Binding Revocation Indication message, it
   sends a Binding Revocation Acknowledgement message as described in
   Section 11.2 to the home agent.  Figure 1 illustrates the message
   sequencing when home agent revokes a mobile node binding
   registration.















Muhanna, et al.         Expires February 16, 2010               [Page 7]

Internet-Draft    Binding Revocation for IPv6 Mobility       August 2009


         MN                                         HA
         |                                           |
         |           HoA in Type 2 Hdr               |
         |<<<------------...  +  ...-----------------|
         |  BRI [seq.#, A bit, Revocation Trigger]   |
         |                                           |
         |                                           |
         | BRA (HoA in Dest. Option)[seq.#, Status]  |
         |---------------------------------------->>>|
         |                                           |
         |                                           |




      Figure 1: Home Agent Revokes a Mobile Node Binding Registration


3.3.  Multi-Care of Addresses (Monami6) Use Case

   In the case of multiple care-of addresses registration [ID-MCoA], the
   home agent maintains different binding for each pair of care-of
   address and home address.  These bindings are also indexed and
   identified during the mobile node registration using a BID mobility
   option.  The HA may revoke one or multiple bindings for the same
   mobile node home address.

   If the home agent revokes a single binding for a mobile node with
   multiple care-of addresses registration, the home agent sends a
   Binding Revocation Indication message to the mobile node with the
   corresponding BID option included.  If more than one of the mobile
   node registered care-of addresses need to be revoked, the home agent
   includes all the corresponding BID options in the same Binding
   Revocation Indication message.  Figure 2 illustrates the message flow
   when the home agent revokes two registered Care-of addresses for the
   same mobile node in a single Binding Revocation Indication message.















Muhanna, et al.         Expires February 16, 2010               [Page 8]

Internet-Draft    Binding Revocation for IPv6 Mobility       August 2009


                                                      HA Binding Cache
                                                      ================
                                                      MN-BID1 [CoA1+HoA]
     MN                                           HA  MN-BID2 [CoA2+HoA]
      |                                            |  MN-BID3 [CoA3+HoA]
      |                                            |  MN-BID4 [CoA4+HoA]
      |             HoA in Type 2 Hdr              |
      |<<<<--------------  +  ---------------------|
      | BRI [seq.#, A bit, R. Trigger, BID1, BID4] |
      |                                            |
      |                                            |
      | BRA (HoA in Dest. Option) [seq.#, Status]  |
      |---------------------------------------->>>>|
      |                                            |
      |                                            |




   Figure 2: Home Agent Revokes MN's Specific Care-of Addresses Bindings


   Additionally, the home agent may revoke all of the mobile node
   registered bindings, by sending a BRI message without including any
   BID options while the HoA is included in the Type 2 routing header.
   Figure 1 illustrates the message flow when the home agent revokes all
   registered Care-of addresses bindings for a mobile node in a single
   Binding Revocation Indication message.

3.4.  Proxy MIPv6 Use Case

   Since the mobile node does not participate in the mobility mechanism
   in the case of PMIPv6, there are many scenarios where Binding
   Revocation mechanism is needed to clean resources and make sure that
   the mobility entities, i.e., mobile access gateway and local mobility
   anchor, are always synchronized with respect to the status of the
   existing PMIPv6 bindings.  The binding revocation mechanism is
   generic enough that can be used for all Proxy Mobile IPv6 scenarios
   that follow [RFC5213] and [ID-PMIP6-IPv4] specifications.

   When the mobile access gateway receives a Binding Revocation
   Indication message as in Section 10.1.1, the mobile access gateway
   sends a Binding Revocation Acknowledgement message to the local
   mobility anchor following the rules described in Section 10.1.2.
   Similarly, if the local mobility anchor receives a Binding Revocation
   Indication message with the Acknowledge (A) bit is set, the local
   mobility anchor responds to the mobile access gateway by sending a
   Binding Revocation Acknowledgement message.



Muhanna, et al.         Expires February 16, 2010               [Page 9]

Internet-Draft    Binding Revocation for IPv6 Mobility       August 2009


3.4.1.  Local Mobility Anchor Initiates PMIPv6 Binding Revocation

   The local mobility anchor may send a Binding Revocation Indication
   message to the mobile access gateway, hosting a specific PMIPv6
   binding, with the appropriate value in the revocation trigger field
   to indicate that the mobile node binding has been terminated and the
   mobile access gateway can clean up the applicable resources.  When
   the mobile access gateway receives a Binding Revocation Indication
   message, the mobile access gateway identifies the respected binding
   and if the Acknowledge (A) bit was set in the received Binding
   Revocation Indication message, it sends a Binding Revocation
   Acknowledgement message to the local mobility anchor.  In this case,
   the mobile access gateway could send a Router Advertisement message
   to the mobile node with the home network prefix valid lifetime set to
   zero.

   As an example, Figure 3, illustrates the message sequence for
   revoking a mobile node binding at the source mobile access gateway
   during the mobile node inter-MAG handover.  During the inter-MAG
   handover, the mobile node moves from the source MAG to the target
   MAG.  The target MAG sends a Proxy Binding Update with the new care-
   of-address to the local mobility anchor to update the mobile node's
   point of attachment.  Since the mobile node binding at the local
   mobility anchor points to the source MAG and upon receiving the Proxy
   Binding Update from the target MAG, the local mobility anchor updates
   the MN BCE and send a Proxy Binding Acknowledgement to the target
   MAG.  The local mobility anchor can send a Binding Revocation
   Indication message with the appropriate revocation trigger value,
   e.g. inter-MAG handover - different Access Types, to the source MAG
   in order to clean up the applicable resources reserved for the
   specified mobile node binding.  The mobile access gateway
   acknowledges the Binding Revocation Indication message by sending a
   Binding Revocation Acknowledgement message to indicate the success or
   failure of the termination of the mobile node's binding.

   The process identified above can also be used by the local mobility
   anchor in scenarios other than the inter-MAG handover with the proper
   revocation trigger value to indicate to the peer mobile access
   gateway that a specific PMIPv6 binding or bindings have been revoked.












Muhanna, et al.         Expires February 16, 2010              [Page 10]

Internet-Draft    Binding Revocation for IPv6 Mobility       August 2009


             oldMAG       newMAG                          LMA
               |             |                            |
               |             |        PBU                 |
               |             |--------------------------->|
               |             |                      PBU triggers
               |             |                   BRI Msg to oldMAG
               |             |                            |
               |             |        PBA                 |
               |             |<---------------------------|
               |             |                            |
               |             |                            |
               | BRI [seq.#, R. Trigger, P, A bits, NAI]  |
               |<-----------------------------------------|
               |             |                            |
               |             |                            |
               |             |                            |
               |             |                            |
               |        BRA [seq.#, Status, P bit]        |
               |----------------------------------------->|
               |             |                            |
               |             |                            |



     Figure 3: LMA Revokes a MN Registration During Inter-MAG Handover


   In addition, the local mobility anchor can send a Binding Revocation
   Indication message to indicate that all bindings which are hosted by
   the peer mobile access gateway and registered with the local mobility
   anchor are being revoked by setting the Global (G) bit as described
   in Section 9.1.1.

3.4.2.  Mobile Access Gateway Revokes Bulk PMIPv6 Bindings

   The mobile access gateway sends a BRI message with the Global (G) bit
   is set to indicate that all mobility bindings which are registered at
   the local mobility anchor and attached to the mobile access gateway
   are being revoked as in Section 10.2.1.  When the local mobility
   anchor receives a Binding Revocation Indication message with the
   Global (G) bit is set from a specified mobile access gateway, the
   local mobility anchor first checks if the mobile access gateway is
   authorized to use global revocations and then responds with the
   appropriate status code by sending a Binding Revocation
   Acknowledgement message as in Section 9.2.2.






Muhanna, et al.         Expires February 16, 2010              [Page 11]

Internet-Draft    Binding Revocation for IPv6 Mobility       August 2009


4.  Security Model

   The binding revocation protocol described here uses the same security
   association between the mobile node and the home agent or the mobile
   access gateway and the local mobility anchor that has been used to
   exchange the corresponding MIPv6 or PMIPv6 Binding Update and Binding
   Acknowledgement when the mobile node binding was created.  If IPsec
   is used, the traffic selectors associated with the SPD entry
   protecting the Binding Update and Binding Acknowledgement MUST be
   extended to include Binding Revocation Signaling MH type <IANA-TBD>.
   Extending the traffic selectors of the SPD entry in order to reuse
   the SA protecting Binding Update and Binding Acknowledgement (instead
   of creating new ones) ensures that those SA will be up and running
   when the revoking entity needs to send a binding revocation signaling
   message.

   Additionally, in the case when the local mobility anchor receives a
   Binding Revocation Indication which indicates a bulk termination
   where the Global (G) bit is set and the Revocation Trigger field is
   set to "Per-Peer Policy", the local mobility anchor MUST verify that
   the mobile access gateway sending the binding revocation indication
   message is authorized to invoke global revocation.


5.  Binding Revocation Messages over IPv4 Transport Network

   In some deployments, the network between the mobile access gateway
   and the local mobility anchor may only support IPv4 transport.
   Another case is when a mobile node which supports client mobile IPv6
   roams to an access network where only IPv4 addressing and transport
   is supported.  In this case, the mobile node is required to register
   an IPv4 home address with its home agent using a mobile IPv6 Binding
   Update message.

   If the Proxy Binding Update and Proxy Binding Acknowledgement
   messages or the Binding Update and Binding Acknowledgement messages
   are sent using UDP encapsulation to traverse NATs, then the Binding
   Revocation messages are sent using the same UDP encapsulation.  The
   same UDP source and destination port numbers and IPv4 addresses used
   for exchanging the Proxy Binding Update and Proxy Binding
   Acknowledgement or the Binding Update and Binding Acknowledgement
   messages will also be used when transporting Binding Revocation
   messages over IPv4 using UDP encapsulation.  For example, the source
   UDP port number, the destination UDP port number, the source IPv4
   address, and the destination IPv4 address of the Binding Revocation
   Indication message MUST be set to the destination UDP port number,
   the source UDP port number, destination IPv4 address, and source IPv4
   address of the latest successfully processed Proxy Binding Update or



Muhanna, et al.         Expires February 16, 2010              [Page 12]

Internet-Draft    Binding Revocation for IPv6 Mobility       August 2009


   Binding Update message received, respectively.  For more details on
   tunneling Proxy Mobile IPv6 and Mobile IPv6 signaling messages over
   IPv4, see [ID-PMIP6-IPv4] and [RFC5555], respectively.


6.  Binding Revocation Message

   This section defines the Binding Revocation Message format using a MH
   Type <IANA-TBD> as illustrated in Figure 4.  The value in the Binding
   Revocation Type field defines whether the Binding Revocation message
   is a Binding Revocation Indication or Binding Revocation
   Acknowledgement.  If the Binding Revocation type field is set to 1,
   the Binding Revocation Message is a Binding Revocation Indication as
   in Section 6.1.  However, if the value is 2, it is a Binding
   Revocation Acknowledgement message as in Section 6.2.



       0                   1                   2                   3
       0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
       +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
       | Payload Proto |  Header Len   |   MH Type     |   Reserved    |
       +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
       |           Checksum            |  B.R. Type    |               |
       +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+               +
       |                                                               |
       .            Binding Revocation Message Data                    .
       |                                                               |
       +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+



                   Figure 4: Binding Revocation Message


   MH Type

      <IANA-TBD> which identifies the mobility message as a Binding
      Revocation message.

   Reserved

      8-bit field reserved for future use.  The value MUST be
      initialized to zero by the sender, and MUST be ignored by the
      receiver.






Muhanna, et al.         Expires February 16, 2010              [Page 13]

Internet-Draft    Binding Revocation for IPv6 Mobility       August 2009


   Checksum

      16-bit unsigned integer.  This field contains the checksum of the
      Mobility Header.  The checksum is calculated as described in
      [RFC3775].

   Binding Revocation Type

      8-bit unsigned integer.  It defines the type of the Binding
      Revocation Message.  It can be assigned one of the following
      values:

          0  Reserved
          1  Binding Revocation Indication Message
          2  Binding Revocation Acknowledgement Message
          All other values are reserved

   Binding Revocation Message Data

      The Binding Revocation Message Data follows the Binding Revocation
      Message format that is defined in this document for the specified
      value in the Binding Revocation Type field.  In this
      specification, it is either a Binding Revocation Indication as in
      Section 6.1 or Binding Revocation Acknowledgement as in
      Section 6.2.

6.1.  Binding Revocation Indication Message

   The Binding Revocation Indication (BRI) message is a Binding
   Revocation Message which has a MH type <IANA-TBD> and a Binding
   Revocation Type value of 1.  It is used by the revoking mobility node
   to inform the receiving mobility entity of the identity of a specific
   binding or bindings which IP mobility service have been revoked.
   Binding Revocation Indication message is sent as described in
   Section 8.1, Section 9.1.1, and Section 10.2.1.

   When the value 1 is indicated in the B. R. type field of the Binding
   Revocation Message, the format of the Binding Revocation Message Data
   follows the Binding Revocation Indication message as in Figure 5












Muhanna, et al.         Expires February 16, 2010              [Page 14]

Internet-Draft    Binding Revocation for IPv6 Mobility       August 2009


       0                   1                   2                   3
       0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
                                       +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
                                       | B.R. Type = 1 |  R. Trigger   |
       +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
       |          Sequence #           |A|P|V|G|     Reserved          |
       +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
       |                                                               |
       .                                                               .
       .                        Mobility options                       .
       |                                                               |
       +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+



              Figure 5: Binding Revocation Indication Message


   Revocation Trigger

      8-bit unsigned integer indicating the event which triggered the
      revoking node to send the BRI message.  The Reserved and Per-MN
      Revocation Triggers value are less than 128 except the reserved
      values 250-255.  The per-MN revocation triggers is used when the
      BRI message intends to revoke one or more bindings for the same
      mobile node.  The Global Revocation Trigger values are greater
      than 128 and less than 250 and used in the BRI message with the
      Global (G) bit set for global revocation.  The following
      Revocation Trigger values are currently defined:

      Reserved and Per-MN Revocation Trigger:
          0  Reserved
          1  Unspecified
          2  Administrative Reason
          3  Inter-MAG Handover - same Access Type
          4  Inter-MAG Handover - different Access Type
          5  Inter-MAG Handover - Unknown
          6  User Initiated Session(s) Termination
          7  Access Network Session(s) Termination
          8  Possible Out-of Sync BCE State
          250-255 Reserved For Testing Purposes only
          All other values are Reserved

      Global Revocation Trigger:







Muhanna, et al.         Expires February 16, 2010              [Page 15]

Internet-Draft    Binding Revocation for IPv6 Mobility       August 2009


          128  Per-Peer Policy
          129  Revoking Mobility Node Local Policy

   Sequence #

      A 16-bit unsigned integer used by the sending mobility node to
      match a returned Binding Revocation Acknowledgement with this
      Binding Revocation Indication.  It could be a random number.

   Acknowledge (A)

      The Acknowledge (A) bit is set by the sending mobility node, e.g.
      LMA, HA, or MAG, to request a Binding Revocation Acknowledgement
      be returned upon receipt of the Binding Revocation Indication as
      in Section 8.1, Section 9.1.1, and Section 10.2.1.

   Proxy Binding (P)

      The Proxy Binding (P) bit is set by the sending mobility node to
      indicate that the revoked binding(s) is a PMIPv6 binding.

   IPv4 HoA Binding Only (V)

      The IPv4 HoA Binding Only (V) bit is set by the sending mobility
      node, home agent or local mobility anchor, to request the
      receiving mobility entity the termination of the IPv4 Home Address
      binding only as in Section 8.1, and Section 9.1.1.

   Global (G)

      The Global (G) bit is set by the sending mobility node, LMA or
      MAG, to request the termination of all Per-Peer mobility Bindings
      or Multiple Bindings which share a common identifier that are
      served by the sending and receiving mobility entities as in
      Section 9.1.1 and Section 10.2.1.

   Reserved

      These fields are unused.  They MUST be initialized to zero by the
      sender and MUST be ignored by the receiver.

   Mobility Options

      Variable-length field of such length that the complete Mobility
      Header is an integer multiple of 8 octets long.  This field
      contains zero or more TLV-encoded mobility options.  This document
      does not define any new mobility option.  The receiver MUST ignore
      and skip any options which it does not understand.  These mobility



Muhanna, et al.         Expires February 16, 2010              [Page 16]

Internet-Draft    Binding Revocation for IPv6 Mobility       August 2009


      option(s) are used by the receiving mobility entity to identify
      the specific binding or bindings that the sending mobility entity
      requesting to be revoked.

   The following options are valid in a Binding Revocation Indication:

   o  Home Network Prefix option [RFC5213].  This option MAY be used
      when the (P) bit is set.  This option MUST be present when the BRI
      is used to revoke a single PMIP binding cache entry.

   o  Mobile Node Identifier Option [RFC4283].  This option is mandatory
      when the (P) bit is set.  Additionally, if the Global (G) bit is
      set by the mobile access gateway, this option carries the MAG
      identity.

   o  Binding Identifier mobility option [ID-MCoA].  This option is
      mandatory if the sending mobility entity requests to terminate one
      binding of a multi care-of addresses bindings for the same mobile
      node.  The sending mobility entity may include more than one of
      the BID mobility options.

   o  IPv4 Home Address option which contains the mobile node home IPv4
      address [RFC5555].  This option is included only when the IPv4 HoA
      Binding only (V) bit is set.

   o  Alternate Care-of Address mobility option [RFC3775].  This option
      MAY be included to indicate the Care-of Address of the mobile
      node's binding that is being revoked.  In the case when the Global
      (G) bit set, this option identifies all the mobility bindings that
      share the same care-of address.  Additionally, if the Global (G)
      bit set, more than one Alternate Care-of Address mobility options
      MAY be present in the Binding Revocation Indication message.

   If no options are present in this message, 4 octets of padding are
   necessary and the Header Len field of the Binding Revocation Message
   will be set to 1.

6.2.  Binding Revocation Acknowledgement Message

   The Binding Revocation Acknowledgement (BRA) message is a Binding
   Revocation Message which has a MH type <IANA-TBD> and a Binding
   Revocation Type value of 2.  It is used to acknowledge the receipt of
   a Binding Revocation Indication message described in Section 6.1.
   This packet is sent as described in Section 9.2.2, Section 10.1.2,
   and Section 11.2.

   When the value 2 is indicated in the Binding Revocation type field of
   the Binding Revocation Message, the format of the Binding Revocation



Muhanna, et al.         Expires February 16, 2010              [Page 17]

Internet-Draft    Binding Revocation for IPv6 Mobility       August 2009


   Message Data follows the Binding Revocation Acknowledgement message
   as in Figure 6



       0                   1                   2                   3
       0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
                                       +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
                                       | B.R. Type = 2 |    Status     |
       +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
       |            Sequence #         |P|V|G|       Reserved          |
       +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
       |                                                               |
       .                                                               .
       .                        Mobility options                       .
       .                                                               .
       |                                                               |
       +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+



           Figure 6: Binding Revocation Acknowledgement Message


   Status

      8-bit unsigned integer indicating the result of processing the
      Binding Revocation Indication message by the receiving mobility
      entity.  Values of the Status field less than 128 indicate that
      the Binding Revocation Indication was processed successfully by
      the receiving node.  Values greater than or equal to 128 indicate
      that the Binding Revocation Indication was rejected by the
      receiving node.  The following status values are currently
      defined:

          0  success
          1  partial success
          128  Binding Does NOT Exist
          129  IPv4 Home Address Option Required
          130  Global Revocation NOT Authorized
          131  Revoked Mobile Nodes Identity Required
          132  Revocation Failed - MN is Attached
          133  Revocation Trigger NOT Supported
          134  Revocation Function NOT Supported







Muhanna, et al.         Expires February 16, 2010              [Page 18]

Internet-Draft    Binding Revocation for IPv6 Mobility       August 2009


   Sequence #

      The sequence number in the Binding Revocation Acknowledgement is
      copied from the Sequence Number field in the Binding Revocation
      Indication.  It is used by the revoking mobility entity, e.g., HA,
      LMA, MAG, in matching this Binding Revocation Acknowledgement with
      the outstanding Binding Revocation Indication.

   Proxy Binding (P)

      The Proxy Binding (P) bit is set if the (P) bit is set in the
      corresponding Binding Revocation Indication message.

   IPv4 HoA Binding Only (V)

      The IPv4 HoA Binding Only (V) bit is set if the (V) bit is set in
      the corresponding Binding Revocation Indication message.

   Global (G)

      The Global (G) bit is set if the (G) bit is set in the
      corresponding Binding Revocation Indication message.

   Reserved

      These fields are unused.  They MUST be initialized to zero by the
      sender and MUST be ignored by the receiver.

   Mobility Options

      Variable-length field of such length that the complete Mobility
      Header is an integer multiple of 8 octets long.  This field
      contains zero or more TLV-encoded mobility options.  In the case
      when the Status field is set to success, no mobility option is
      required.  The mobility option(s) is usually used to communicate
      information of the bindings that failed the revocation procedure.

   The following mobility options are valid in a Binding Revocation
   Acknowledgement:

   o  Home Network Prefix option [RFC5213].  This option MAY be included
      when the (P) bit is set.

   o  Mobile Node Identifier Option [RFC4283].  This option MAY be
      included when the (P) bit is set.  This option SHOULD be included
      if the Home Network Prefix option is included.





Muhanna, et al.         Expires February 16, 2010              [Page 19]

Internet-Draft    Binding Revocation for IPv6 Mobility       August 2009


   o  Binding Identifier mobility option [ID-MCoA].  This option MAY be
      included to indicate the specific BID that the receiving node
      failed to revoke.

   If no options are present in this message, 4 octets of padding are
   necessary and the Header Len field of the Binding Revocation Message
   will be set to 1.


7.  Binding Revocation Process Operation

   The following subsections describe the details of the binding
   revocation generic process by the different mobility entities.

7.1.  Sending Binding Revocation Messages

   When sending a Binding Revocation message, the sending mobility node,
   initiator, constructs the packet as it would any other Mobility
   Header with the exception of setting the MH Type field to <IANA-TBD>.


   In addition, the mobility entity which initiates the binding
   revocation process by sending a Binding Revocation Indication
   message, initiator, MUST construct the Binding Revocation Message
   Data following the format of the Binding Revocation Indication
   message as described in Section 6.1.  In the BRI message, the
   initiator MUST set the Sequence Number field to the next sequence
   number available for Binding Revocation.  Since sending Binding
   Revocation Indication message is not done on a regular basis, a 16
   bit sequence number field is large enough to allow the initiator to
   match the Binding Revocation Acknowledgement to the outstanding
   Binding Revocation Indication with Acknowledge (A) bit set using the
   sequence number field only.


   However, when the responder acknowledges the Binding Revocation
   Indication message, the responder MUST constructs the Binding
   Revocation message packet as it would any other Mobility Header with
   the exception of setting the MH Type field to <IANA-TBD>.  It also
   MUST construct the Binding Revocation Message Data following the
   format of the Binding Revocation Acknowledgement message as described
   in Section 6.2.  In this case, the responder MUST set the Sequence
   Number field by copying the value from the Sequence Number field of
   the received Binding Revocation Indication.  Additionally, it MUST
   set the status field to a valid value that reflects the processing of
   the received Binding Revocation Indication.





Muhanna, et al.         Expires February 16, 2010              [Page 20]

Internet-Draft    Binding Revocation for IPv6 Mobility       August 2009


   A mobility entity MUST secure Binding Revocation Indication and
   Binding Revocation Acknowledgement messages with the same underlying
   security association, e.g., IPsec SA, that has been used to secure
   the mobile node binding registration signaling.

7.2.  Receiving Binding Revocation Messages

   When receiving a Binding Revocation message, the receiving mobility
   node MUST verify the Mobility Header as described in section 9.2. of
   [RFC3775].  If the packet is dropped due to failing any of the
   Mobility Headers test check, the receiving node MUST follow the
   processing rules as in Section 9.2 of [RFC3775].  If the receiving
   node does not support the Binding Revocation Indication message and
   does not recognize the new MH type, it sends a Binding Error message
   with the Status field set to 2 as described in [RFC3775].


   Since some mobility entities, e.g., local mobility anchor and mobile
   access gateway, are allowed to receive and possibly send a Binding
   Revocation Indication or Binding Revocation Acknowledgement for
   different cases, therefore, if IPsec is used to secure signaling
   between the local mobility anchor and mobile access gateway, it
   prevents any of them from processing a Binding Revocation message
   that was not constructed by an authorized party.


   Upon receiving a packet carrying a Binding Revocation Indication or
   Binding Revocation Acknowledgement, the receiving mobility entity
   verifies that the packet was received protected with the security
   association that has been used during the binding registration
   signaling phase, e.g., an IPsec SA.


   Upon receiving a packet carrying a Binding Revocation
   Acknowledgement, the receiving mobility entity, initiator, MUST
   validate that sequence number in the Sequence Number field matches
   the sequence number of an outstanding Binding Revocation Indication
   that was sent by the initiator.  If the sequence number does not
   match any sequence number of any of the outstanding Binding
   Revocation Indication, the receiving node MUST silently discard the
   message but MAY log the event.


   If a mobility node receives a Binding Revocation Indication message
   with the Revocation Trigger field is set to a value that NOT
   supported, the receiving mobility node SHOULD reject the Binding
   Revocation Indication message by sending a Binding Revocation
   Acknowledgement message with the Status field set to "Revocation



Muhanna, et al.         Expires February 16, 2010              [Page 21]

Internet-Draft    Binding Revocation for IPv6 Mobility       August 2009


   Trigger NOT Supported".


   If a mobility node receives a Binding Revocation Indication message
   with a Revocation Trigger value that is NOT in line with the Binding
   Revocation Indication message intent, e.g., the Global (G) bit set
   and the Revocation Trigger field vale is a per-MN specific, the
   receiving mobility node SHOULD reject the Binding Revocation
   Indication message by sending a Binding Revocation Acknowledgement
   message with the Status field set to "Revocation Function NOT
   Supported".

7.3.  Retransmission of Binding Revocation Indication

   If the sending mobility entity does not receive a Binding Revocation
   Acknowledgement in response to the outstanding initial Binding
   Revocation Indication before the InitMINDelayBRIs timer expires, the
   mobility entity, e.g.  LMA, SHOULD retransmit the same BRI message up
   to the BRIMaxRetriesNumber as defined in Section 12.

   The retransmissions by the sending mobility entity MUST use an
   exponential back-off process in which the timeout period is doubled
   upon each retransmission, until either the node receives a response
   or the timeout period reaches the value MAX_BRACK_TIMEOUT.  The
   sending mobility entity MAY continue to send these messages at this
   slower rate up to the BRIMaxRetriesNumber.

   If the revoking mobility entity does not receive a Binding Revocation
   Acknowledgement message after the maximum number of retransmits have
   been sent, the revoking mobility entity can clean the mobile node
   binding cache and all resources associated with this binding.  The
   revoking mobility entity may log the event.


8.  Home Agent Operation

8.1.  Sending Binding Revocation Indication

   To terminate a mobile node registration and its current binding with
   the home agent, the home agent sends a packet to the mobile node
   containing a Binding Revocation Indication, with the packet
   constructed as follows:

   o  The Acknowledge (A) bit MAY be set to request the mobile node to
      send a Binding Revocation Acknowledgement upon receipt of the
      Binding Revocation Indication.





Muhanna, et al.         Expires February 16, 2010              [Page 22]

Internet-Draft    Binding Revocation for IPv6 Mobility       August 2009


   o  The Revocation Trigger field MUST be set to indicate to the mobile
      node the reason for revoking its IP mobility binding with the home
      agent.  The Revocation Trigger may be used by the mobile node to
      take further steps if necessary.

   o  The Binding Revocation Indication MUST be sent using a Type 2
      routing header which contains the mobile node's registered IPv6
      home address for the binding being revoked.

   o  The care-of address for the binding MUST be used as the
      destination address in the packet's IPv6 header, unless an
      Alternate Care-of Address mobility option is included in the
      Binding Revocation Indication.

   o  If the home agent needs to only revoke the mobile node's IPv4 home
      address binding, the home agent MUST set the IPv4 HoA Binding Only
      (V) bit and MUST include the mobile node's registered IPv4 home
      address that is being revoked in the IPv4 Home Address option.


   The Acknowledge (A) bit in the Binding Revocation Indication requests
   the mobile node to return a Binding Revocation Acknowledgement in
   response to this Binding Revocation Indication.  As described in
   Section 7.3, the home agent SHOULD retransmit this Binding Revocation
   Indication to the mobile node before terminating its IP connection
   until it receives a matching Binding Revocation Acknowledgement or
   the BRIMaxRetransmitNumber has been reached.

   When the home agent sends a Binding Revocation Indication to the
   mobile node with the Acknowledge (A) bit set, the home agent sets a
   flag in the mobile node BCE to indicate that revocation is in
   progress and starts the InitMINDelayBRIs timer.  The home agent
   maintains the mobile node BCE in this state until it receives a
   Binding Revocation Acknowledgement or retransmits the Binding
   Revocation Indication message as described in Section 7.3.

   In a race condition case, the home agent may receive a Binding Update
   from the mobile node while the mobile node's BCE has the revocation
   in progress flag set, the home agent SHOULD handle this case based on
   the reason for sending the Binding Revocation Indication message and
   its local policy.  In this case, if the home agent accepts the
   Binding Update, it needs to update the mobile node BCE accordingly,
   e.g. removing the revocation in progress flag.

   When the home agent needs to revoke one or more of a mobile node
   bindings that were created using Multi Care-of address registration
   as in [ID-MCoA], the home agent MUST include all the related BID
   mobility options that identify these bindings in the Binding



Muhanna, et al.         Expires February 16, 2010              [Page 23]

Internet-Draft    Binding Revocation for IPv6 Mobility       August 2009


   Revocation Indication message.  In the case when the home agent needs
   to revoke all of the mobile node bindings, the home agent SHOULD NOT
   include any of the BID mobility options.

8.2.  Receiving Binding Revocation Acknowledgement

   When the home agent receives a packet carrying a valid Binding
   Revocation Acknowledgement that was successfully processed as in
   Section 7.2, the home agent SHOULD examine the Status field as
   follows:

   o  If the Status field indicates that the Binding Revocation
      Indication was processed successfully, the home agent deletes the
      current timer and the mobile node bindings and all related
      resources.

   o  If the Status field indicates any value other than success, the
      home agent SHOULD examine any mobility options included in the
      Binding Revocation Acknowledgement.  The home agent MAY log the
      appropriate event to reflect the received status.


9.  Local Mobility Anchor Operation

9.1.  Binding Revocation Initiator

9.1.1.  Sending Binding Revocation Indication

   To terminate a mobile node PMIPv6 registration and its current
   binding with the local mobility anchor, the local mobility anchor
   sends a packet to the mobile access gateway containing a Binding
   Revocation Indication message following the procedure in Section 7.1
   and the following rules:

   o  The Acknowledge (A) bit MAY be set to request the mobile access
      gateway to send a Binding Revocation Acknowledgement upon receipt
      of the Binding Revocation Indication.

   o  The Proxy Mobile IP (P) bit MUST be set to indicate that the
      binding being revoked is a PMIPv6 binding.

   o  The Revocation Trigger field MUST be set to indicate to the mobile
      access gateway the reason for removing the specified mobile node
      PMIPv6 binding at the local mobility anchor.  The Revocation
      Trigger may be used by the mobile access gateway to learn the
      mobile node's latest movement.





Muhanna, et al.         Expires February 16, 2010              [Page 24]

Internet-Draft    Binding Revocation for IPv6 Mobility       August 2009


   o  In case of revoking all Per-Peer bindings, the Global (G) bit MUST
      be set and the Revocation Trigger MUST contain a value of "Per-
      Peer Policy" to request the mobile access gateway to remove all
      Per-Peer bindings that are registered with the local mobility
      anchor and hosted at this mobile access gateway.

   o  Whenever the Global (G) bit is set in the Binding Revocation
      Indication, the Acknowledge (A) bit MUST be set to request the
      mobile access gateway to send a Binding Revocation
      Acknowledgement.

   o  The packet MUST contain the Mobile Node Identifier, MN-ID, option
      which contains the mobile node's NAI that was used in the Proxy
      Binding Update during the mobile node registration.

   o  If the Mobile Node Identifier, MN-ID, is registered in more than
      one of the mobile node's BCE and the local mobility anchor does
      NOT need to revoke all of the mobile node's bindings, the packet
      MUST contain another identifier to uniquely identify the mobile
      node binding(s) that is being revoked, e.g., at least one Home
      Network Prefix option which contains the mobile node's registered
      HNP for the binding being revoked.

   o  The care-of address for the binding MUST be used as the
      destination address in the packet's IPv6 header, unless an
      Alternate Care-of Address mobility option is included in the
      Binding Revocation Indication message.


   The Acknowledge (A) bit in the Binding Revocation Indication requests
   the mobile access gateway to return a Binding Revocation
   Acknowledgement.  As described in Section 7.3, the local mobility
   anchor SHOULD retransmit this Binding Revocation Indication before
   deleting the mobile node IP tunnel to the mobile access gateway until
   it receives a matching Binding Revocation Acknowledgement or the
   BRIMaxRetransmitNumber is reached.  The local mobility anchor MAY
   delete the mobile node(s) IP tunnel immediately after sending the
   Binding Revocation Indication and before receiving the Binding
   Revocation Acknowledgement message.

   When the local mobility anchor sends a Binding Revocation Indication
   to the mobile access gateway to remove a specific binding and the
   Acknowledge (A) bit is set, the local mobility anchor sets a flag in
   the mobile node proxy BCE to indicate that revocation is in progress
   and starts the InitMINDelayBRIs timer.  The local mobility anchor
   SHOULD maintain the mobile node proxy BCE in this state until it
   receives a Binding Revocation Acknowledgement or the
   BRIMaxRetransmitNumber is reached.  In the case when the local



Muhanna, et al.         Expires February 16, 2010              [Page 25]

Internet-Draft    Binding Revocation for IPv6 Mobility       August 2009


   mobility anchor sets the Revocation Trigger field to a value which
   indicates inter-MAG handover, the local mobility anchor MAY switch
   the mobile node IP tunnel to the target mobile access gateway before
   sending the Binding Revocation Indication to the source mobile access
   gateway.

   In a race condition case, the local mobility anchor may receive a
   Proxy Binding Update from the mobile access gateway while the mobile
   node's proxy BCE has the revocation in progress flag set, the local
   mobility anchor should handle this case based on the reason for
   sending the Binding Revocation Indication message and its local
   policy.  In this case, if the local mobility anchor accepts the Proxy
   Binding Update, it needs to update the mobile node proxy BCE
   accordingly, e.g. removing the revocation in progress flag.

   When the local mobility anchor needs to revoke all mobile nodes proxy
   BCE that are registered with the local mobility anchor and hosted at
   the mobile access gateway, it MUST set the Global (G) bit and set the
   value of the Revocation Trigger field to "Per-Peer Policy".  In this
   case, the local mobility anchor MUST NOT include any mobility options
   in the this Binding Revocation Indication message.

   When the local mobility anchor needs to revoke all mobile nodes proxy
   BCE that belong to a specific realm, e.g. @example.com, that are
   registered with the local mobility anchor and hosted at the mobile
   access gateway, the local mobility anchor MUST set the Global (G) bit
   and set the value of the Revocation Trigger field to "Revoking
   Mobility Node Local Policy".  In this case, the local mobility anchor
   MUST include a mobility option in the Binding Revocation Indication
   to identify the impacted bindings, e.g., MN-ID option with an NAI
   value of @example.com, to identify all the mobile nodes BCEs that
   have a MN-ID with a realm that matches the NAI value in the received
   MN-ID option and need to be removed.

   When the mobile node is registered with multiple Home Network
   Prefixes for the same proxy care-of address, the local mobility
   anchor SHOULD include a HNP option for each registered HNP in the
   Binding Revocation Indication.  Alternatively, it MAY include only
   the mobile node identifier, MN-ID, option to indicate to the mobile
   access gateway to remove all bindings of the specified mobile node
   NAI in the MN-ID option.


   According to Proxy Mobile IPv6 specification [RFC5213], if the local
   mobility anchor receives a Proxy Binding Update message from a new
   mobile access gateway for extending the binding lifetime of the only
   BCE of this mobile node with the Handoff Indicator value is set to
   "Inter-MAG Handover - Unknown", the local mobility anchor waits a



Muhanna, et al.         Expires February 16, 2010              [Page 26]

Internet-Draft    Binding Revocation for IPv6 Mobility       August 2009


   period of MaxDelayBeforeNewBCEAssign to receive a de-registration
   message from the previous mobile access gateway before updating the
   mobile node's BCE with the new point of attachment.  If a de-
   registration message is not received,, the local mobility anchor
   considers the received Proxy Binding Update message as a request for
   a new BCE and if processed successfully, the local mobility anchor
   assigns a different HNP for the new BCE.


   This document updates the local mobility anchor's behavior in this
   case.  If the local mobility anchor supports the binding revocation
   mechanism as described in this document, it SHOULD proactively send a
   Binding Revocation Indication message to the previous mobile access
   gateway instead of waiting for a de-registration from the previous
   mobile access gateway.  In the Binding Revocation Indication message,
   the Acknowledge (A) bit MUST be set and the Revocation Trigger MUST
   be set to "Inter-MAG Handover - Unknown".


   If the local mobility anchor sent a Binding Revocation Indication
   message with the Revocation Trigger field set to "Inter-MAG Handover
   - Unknown" and while waiting for a Binding Revocation Acknowledgement
   response, the following are possible conditions that the local
   mobility anchor MUST handle as specified below:

   o  If the local mobility anchor receives a successful Binding
      Revocation Acknowledgement message or a de-registration message
      from the previous mobile access gateway, the local mobility anchor
      MUST update the mobile node BCE in a similar way as if it received
      a de-registration message as described in [RFC5213].

   o  If the local mobility anchor receives a Binding Revocation
      Acknowledgement message with the status field set to "Revocation
      Failed - MN is Attached", the local mobility anchor SHOULD update
      the mobile node BCE in a similar way as if it did NOT receive a
      de-registration before the MaxDelayBeforeNewBCEAssign timer
      expires by creating a new BCE as described in [RFC5213].

   o  If the local mobility anchor did not receive a Binding Revocation
      Acknowledgement message nor a de-registration Proxy Binding Update
      from the previous mobile access gateway after it exhausted all of
      the Binding Revocation Indication message retransmissions as
      described in Section 7.3, the local mobility anchor SHOULD update
      the mobile node's BCE in a similar way as if it did NOT receive a
      de-registration before the MaxDelayBeforeNewBCEAssign timer
      expires by creating a new BCE as described in [RFC5213].  Note
      that the local mobility anchor SHOULD use the recommended number
      of retransmissions for the Binding Revocation Indication message



Muhanna, et al.         Expires February 16, 2010              [Page 27]

Internet-Draft    Binding Revocation for IPv6 Mobility       August 2009


      as described in Section 12 to avoid delaying the creation of a new
      binding cache entry for too long, if the mobile node is actually
      attaching to the new MAG with a different interface.



   When the mobile node is registered with an IPv4 proxy home address in
   addition to the Home Network Prefix where both of the IPv4 pHoA and
   HNP are bound to the same proxy CoA, the local mobility anchor MAY
   revoke the mobile node IPv4 proxy HoA binding to the current mobile
   node proxy CoA while maintaining the mobile node binding of the HNP
   to its current pCoA as part of the mobile node BCE.  In this case, if
   the local mobility anchor decides to revoke the mobile node IPv4
   proxy HoA ONLY, it MUST send a Binding Revocation Indication message
   following the procedure in Section 7.1 and the following rules:

   o  The IPv4 HoA Binding Only (V) bit MUST be set in the BRI to
      indicate that only the IPv4 home address binding is being revoked.

   o  The Acknowledge (A) bit MUST be set to request the mobile access
      gateway to send a Binding Revocation Acknowledgement message.

   o  The IPv4 Home Address option MUST be included with the mobile
      node's registered IPv4 home address that is being released in
      addition to the MN-ID option.

   o  The mobile node Home Network Prefix option MUST NOT be included.

   o  The Revocation Trigger field MUST be set to an appropriate value,
      e.g.  "User Initiated Session(s) Termination".


9.1.2.  Receiving Binding Revocation Acknowledgement

   When the local mobility anchor receives a packet carrying a valid
   Binding Revocation Acknowledgement that was successfully processed as
   in Section 7.2 and if the mobile node BCE is in the state of
   Revocation in progress, the local mobility anchor SHOULD examine the
   Status field before clearing the mobile node related resources as
   follows:

   o  If the Status field indicates that the BRI was processed
      successfully, the local mobility anchor MUST delete the current
      timer and the mobile node proxy bindings and all associated
      resources.






Muhanna, et al.         Expires February 16, 2010              [Page 28]

Internet-Draft    Binding Revocation for IPv6 Mobility       August 2009


   o  If the Status field indicates partial success value or MN binding
      does not exist, the local mobility anchor SHOULD examine mobility
      options that are included in the Binding Revocation
      Acknowledgement, if any, before deleting the current timer and the
      mobile node associated proxy bindings and other related resources.
      It is based on the local mobility anchor local policy how to
      handle the mobile node BCE(s) that the mobile access gateway
      indicated it failed the revocation procedure, however, the LMA MAY
      log the event.


9.2.  Binding Revocation Responder

9.2.1.  Receiving Binding Revocation Indication

   When the local mobility anchor receives a packet carrying a Binding
   Revocation Indication that was successfully processed as in
   Section 7.2, the local mobility anchor SHOULD in addition process the
   message as follows:

   o  Binding Revocation Indication is formatted as in Section 6.1 and
      if the (P) bit is set, the local mobility anchor MUST validate
      that all impacted binding(s) have the proxy binding flag set.

   o  If the Global (G) bit is set and the Revocation Trigger value is
      "Per-Peer Policy", the Proxy (P) bit MUST be set and the Binding
      Revocation Indication SHOULD contain the mobile access gateway ID
      in the MN-ID option.  The local mobility anchor MUST verify that
      the identified mobile access gateway as per the value in the MN-ID
      option is authorized to use the Global revocation.  The mechanism
      the local mobility anchor uses to verify the mobile access gateway
      authorization is out of scope of this document.

   o  If the Global (G) bit is set and the Revocation Trigger value is
      "Per-Peer Policy", and only the mobile node identifier, MN-ID,
      option is included, the local mobility anchor MUST revoke all
      mobile nodes bindings which proxy CoA is the one used as the
      source of the IPv6 packet that carried the Binding Revocation
      Indication.  However, if one or more Alternate Care-of Address
      options are included in addition to the mobile node identifier
      option, the local mobility anchor MUST revoke all mobile nodes
      bindings which proxy Care-of Address matches one of the Care-of
      address(es) in the Alternate Care-of Address option(s).

   o  The local mobility anchor identifies all impacted mobile nodes
      bindings and if the Acknowledge (A) bit is set, the local mobility
      anchor MUST send a Binding Revocation Acknowledgement following
      Section 9.2.2 using the appropriate status code.



Muhanna, et al.         Expires February 16, 2010              [Page 29]

Internet-Draft    Binding Revocation for IPv6 Mobility       August 2009


   o  If the Global (G) bit is NOT set, the local mobility anchor SHOULD
      use the included mobility options to identify the impacted mobile
      node binding as follows:

      1.  If only the mobile node identifier, MN-ID, option is included,
          the local mobility anchor MUST revoke all bindings for this
          mobile node which use the specified mobile node NAI.

      2.  If the mobile node identifier, MN-ID, and the Home Network
          Prefix option are included, the local mobility anchor MUST
          only remove the specified proxy binding.

      3.  If the mobile node identifier, MN-ID, option and more than one
          Home Network Prefix options are included, the local mobility
          anchor MUST remove all bindings which are referenced by these
          multiple Home Network Prefixes for the specified mobile node
          NAI.


   The Revocation Trigger field value in the received Binding Revocation
   Indication could be used by the local mobility anchor to log an event
   or update some local parameters which tracks the state of the peer
   mobile access gateway.

9.2.2.  Sending Binding Revocation Acknowledgement

   When the local mobility anchor receives a valid Binding Revocation
   Indication with the Acknowledge (A) bit set and after processing the
   Binding Revocation Indication message, the local mobility anchor
   sends a packet to the mobile access gateway containing a Binding
   Revocation Acknowledgement following the process in Section 7.1 and
   the following:

   o  If the (P) bit was set in the received Binding Revocation
      Indication, the local mobility anchor MUST set the (P) bit in the
      Binding Revocation Acknowledgement.

   o  If the Global (G) bit was set in the received Binding Revocation
      Indication, the local mobility anchor MUST set the Global (G) bit
      in the Binding Revocation Acknowledgement.

   o  If the IPv4 HoA Binding Only (V) bit was set in the received
      Binding Revocation Indication, the local mobility anchor MUST set
      the (V) bit in the Binding Revocation Acknowledgement.

   o  The local mobility anchor MUST set the Status field to a valid
      code that reflects the processing of the received Binding
      Revocation Indication.  If the mobile access gateway is not



Muhanna, et al.         Expires February 16, 2010              [Page 30]

Internet-Draft    Binding Revocation for IPv6 Mobility       August 2009


      authorized to use the Per-Peer Global revocation feature, the
      local mobility anchor MUST set the Status field to (Global
      Revocation NOT Authorized).

   o  In the case that one of the bindings identified in the received
      Binding Revocation Indication message has already been released,
      the local mobility anchor MAY set the Status field to partial
      success and in this case it MAY include the mobile node identifier
      or the Home Network Prefix option to identify the binding(s) that
      failed revocation.

   o  The destination IP address of the IPv6 packet of the Binding
      Revocation Acknowledgement is set to the source IP address of the
      received Binding Revocation Indication.


10.  Mobile Access Gateway Operation

10.1.  Binding Revocation Responder

10.1.1.  Receiving Binding Revocation Indication

   Upon receiving a packet carrying a Binding Revocation Indication, the
   mobile access gateway MUST validate the packet according to
   Section 7.2 and the following:

   o  Binding Revocation Indication MUST be formatted as in Section 6.1
      and the (P) bit is set.

   o  If the Acknowledge (A) bit in the received Binding Revocation
      Indication is set, the mobile access gateway MUST send a Binding
      Revocation Acknowledgement following Section 10.1.2 using the
      appropriate status value.

   o  If the Global (G) bit is set and the Revocation Trigger field
      value is "Per-Peer policy", the mobile access gateway identifies
      all bindings that are registered at the local mobility anchor and
      hosted at the mobile access gateway.  This Binding Revocation
      Indication does not include any other mobility options.  In this
      case, the mobile access gateway MUST send a Binding Revocation
      Acknowledgement with the appropriate status code to the local
      mobility anchor.

   o  If the Global (G) bit is set and the Revocation Trigger field
      value is "Revoking Mobility Node Local Policy", the mobile access
      gateway MUST identify all bindings that are registered at the
      local mobility anchor and hosted at the mobile access gateway
      using the mobility option(s) included in the Binding Revocation



Muhanna, et al.         Expires February 16, 2010              [Page 31]

Internet-Draft    Binding Revocation for IPv6 Mobility       August 2009


      Indication which SHOULD include at least the MN-ID option, e.g.,
      with a wild card NAI.  In this case, the mobile access gateway
      MUST send a Binding Revocation Acknowledgement with the
      appropriate status code to the local mobility anchor.

   o  If the Global (G) bit is set and the Revocation Trigger field
      value is "Revoking Mobility Node Local Policy", and no mobility
      options are included in the Binding Revocation Indication message
      or the mobile access gateway is not able to identify the impacted
      mobile nodes bindings based on the included mobility options, the
      mobile access gateway MUST treat this as an error scenario.  In
      this case, the mobile access gateway SHOULD send a Binding
      Revocation Acknowledgement message with status "Revoked Mobile
      Nodes Identity Required".

   o  If the Revocation Trigger field value in the received Binding
      Revocation Indication message indicates inter-MAG handover, e.g.,
      Inter-MAG Handover - Unknown, and the Acknowledge (A) bit is set,
      the mobile access gateway uses the mobility option(s) included in
      the Binding Revocation Indication message to identify the mobile
      node binding.  The mobile access gateway SHOULD validate that the
      mobile node is no longer attached to the mobile access gateway
      before sending a successful Binding Revocation Acknowledgement
      message to the local mobility anchor.  However, if the mobile
      access gateway verified that the mobile node is still directly
      attached, the mobile access gateway MUST set the status field in
      the Binding Revocation Acknowledgement to "Revocation failed - MN
      is Attached".

   o  If the IPv4 HoA Binding Only (V) bit in the received Binding
      Revocation Indication message is set, the mobile access gateway
      uses the MN-ID option to identify the mobile node binding entry in
      the Binding Update List (BUL).  It MUST verify that the IPv4
      address included in the IPv4 Home Address option in the received
      Binding Revocation Indication is the same as the IPv4 proxy HoA
      that is assigned to the mobile node.  After the mobile access
      gateway successfully validates the received IPv4 home address as
      the mobile node IPv4 HoA, it MUST consider this as an indication
      to release the mobile node IPv4 proxy HoA binding to the mobile
      node current proxy CoA ONLY.  Consequently, it MUST continue to
      maintain the mobile node IPv6 proxy HoA or HNP binding to the
      current mobile node proxy CoA as part of the mobile node binding
      in the BUL entry and release all resources associated with the MN
      IPv4 proxy HoA binding to the MN pCoA.  In this case, the mobile
      access gateway MUST send a Binding Revocation Acknowledgement
      message with the Status field is set to success.  On the other
      hand, if the mobile access gateway is able to identify the mobile
      node binding using the MN-ID but failed to identify the received



Muhanna, et al.         Expires February 16, 2010              [Page 32]

Internet-Draft    Binding Revocation for IPv6 Mobility       August 2009


      IPv4 proxy HoA, it MUST send a Binding Revocation Acknowledgement
      with Status field is set to "Binding Does NOT Exist".

   The Revocation Trigger field value in the received Binding Revocation
   Indication could be used by the mobile access gateway to define what
   actions the mobile access gateway could do to inform the mobile node
   that its IP connectivity to the current HNP has been terminated,
   e.g., if the Revocation Trigger field is set to "Administrative
   Reason", the mobile access gateway may send a RA message after
   setting the Home Network Prefix valid lifetime to zero.

10.1.2.  Sending Binding Revocation Acknowledgement

   When the mobile access gateway receives a valid Binding Revocation
   Indication with the Acknowledge (A) bit set and after processing it,
   the mobile access gateway sends a packet to the local mobility anchor
   containing a Binding Revocation Acknowledgement according to the
   procedure in Section 7.1 and the following:

   o  The mobile access gateway MUST set the (P) bit in the Binding
      Revocation Acknowledgement if it is set in the received Binding
      Revocation Indication.

   o  If the Global (G) bit was set in the received Binding Revocation
      Indication, the mobile access gateway MUST set the Global (G) bit
      in the Binding Revocation Acknowledgement.

   o  If the IPv4 HoA Binding Only (V) bit was set in the received
      Binding Revocation Indication, the mobile access gateway MUST set
      the (V) bit in the Binding Revocation Acknowledgement.

   o  The mobile access gateway MUST set the Status field to a valid
      code that reflects the processing of the received Binding
      Revocation Indication.

   o  In the case that one or more of the bindings identified in the
      received Binding Revocation Indication message has already been
      released before receiving the Binding Revocation Indication, the
      mobile access gateway MAY set the Status field to "partial
      success" and include the mobile node identifier, MN-ID, or the
      Home Network Prefix option to identify the binding(s) that failed
      to be removed as part of the revocation procedure.

   o  The destination IP address of the IPv6 packet of the Binding
      Revocation Acknowledgement is set to the source IP address of the
      received Binding Revocation Indication.





Muhanna, et al.         Expires February 16, 2010              [Page 33]

Internet-Draft    Binding Revocation for IPv6 Mobility       August 2009


10.2.  Binding Revocation Initiator

10.2.1.  Sending Binding Revocation Indication

   The mobile access gateway could send a Binding Revocation Indication
   message to indicate the termination of multiple mobile node bindings,
   e.g., when using the global revocation with the Global (G) bit set.
   In this case when an event occurs which requires the mobile access
   gateway to inform the local mobility anchor to terminate all mobile
   nodes bindings which are registered at the local mobility anchor and
   the mobile access gateway, the mobile access gateway sends a Binding
   Revocation Indication message following Section 7.1 and the
   following:

   o  The Acknowledge (A) bit MUST be set to request the local mobility
      anchor to send a Binding Revocation Acknowledgement upon receipt
      of the Binding Revocation Indication.

   o  The Proxy Binding (P) bit MUST be set to indicate that bindings
      that being revoked is a PMIPv6 binding.

   o  The Global (G) bit MUST be set and the Revocation Trigger MUST
      contain a value of "Per-Peer Policy" in the Binding Revocation
      Indication to request the local mobility anchor to remove all Per-
      Peer bindings that are registered with the local mobility anchor
      and hosted at this mobile access gateway.  In this case, the MN-ID
      option MUST be included in the Binding Revocation Indication and
      contain the mobile access gateway identity.  In addition, the
      mobile access gateway MAY include one or more Alternate Care-of
      Address option(s).  The Alternate Care-of Address option(s)
      contain the proxy Care-of address(es) the bindings of which are
      being impacted by this Binding Revocation Indication message.

   o  The mobile access gateway address MAY be used as the source
      address in the packet's IPv6 header.

   The Acknowledge (A) bit in the Binding Revocation Indication requests
   the local mobility anchor to return a Binding Revocation
   Acknowledgement in response to this Binding Revocation Indication.
   As described in Section 7.3, the mobile access gateway SHOULD
   retransmit this Binding Revocation Indication to the local mobility
   anchor until it receives a matching Binding Revocation
   Acknowledgement or the BRIMaxRetransmitNumber is reached.  The mobile
   access gateway MAY delete the mobile nodes IP tunnels immediately
   after sending the Binding Revocation Indication and before receiving
   a Binding Revocation Acknowledgement message from the LMA.





Muhanna, et al.         Expires February 16, 2010              [Page 34]

Internet-Draft    Binding Revocation for IPv6 Mobility       August 2009


10.2.2.  Receiving Binding Revocation Acknowledgement

   When the mobile access gateway receives a packet carrying a valid
   Binding Revocation Acknowledgement that was successfully processed
   according to Section 7.2, the mobile access gateway MUST process the
   received Binding Revocation Acknowledgement as per the followings:

   o  When the mobile access gateway receives a packet carrying a valid
      Binding Revocation Acknowledgement and the Global (G) and Proxy
      Binding (P) bits are set and the mobile nodes BCEs are in the
      state of Revocation in Progress, the mobile access gateway SHOULD
      examine the Status field as follows:

   o  If the Status field indicates that the Binding Revocation
      Indication was processed successfully, the mobile access gateway
      delete the current timer and the mobile nodes proxy bindings and
      all associated resources.

   o  If the Status field indicates (Global Revocation NOT Authorized),
      the mobile access gateway is not authorized to participate in a
      Per-Peer Global Revocation.  The mobile access gateway SHOULD NOT
      retry sending a Binding Revocation Indication with the Global (G)
      bit set to the same local mobility agent.  The mobile access
      gateway should raise an alarm or log an event to indicate this
      rejection.


11.  Mobile Node Operation

11.1.  Receiving Binding Revocation Indication

   Upon receiving a packet carrying a Binding Revocation Indication, the
   mobile node MUST validate the packet according to Section 7.2 and the
   following tests:

   o  The mobile node MUST verify that the IP address in the Type 2
      routing header is its Home Address and that its Binding Update
      List contains an entry for that Home Address.  If one of the
      tests, fails the mobile node SHOULD silently discard the received
      Binding Revocation Indication message.

   o  If the Acknowledge (A) bit is set in the Binding Revocation
      Indication and its Binding Update List contains an entry for the
      IP address in the Type 2 routing header, the mobile node MUST send
      a Binding Revocation Acknowledgement.  However, in all other cases
      when the Acknowledge (A) bit is set in the BRI, the mobile node
      SHOULD send a Binding Revocation Acknowledgement.  In all cases,
      the mobile node MUST follow Section 11.2 and send a Binding



Muhanna, et al.         Expires February 16, 2010              [Page 35]

Internet-Draft    Binding Revocation for IPv6 Mobility       August 2009


      Revocation Acknowledgement using the appropriate status code.

   o  If the IPv4 HoA Binding Only (V) bit is set in the received BRI
      message, the mobile node MUST verify that there is an IPv4 Home
      Address option in the received Binding Revocation Indication and
      the IPv4 address included in the IPv4 Home Address option is the
      same as its IPv4 HoA that is assigned to the mobile node.  If this
      verification is successful, the mobile node MUST consider this
      Binding Revocation Indication as an indication to release the
      mobile node IPv4 HoA binding ONLY to its current Care-of Address.
      Consequently, the mobile node MUST continue to maintain its IPv6
      HoA binding to the current CoA as part of the mobile node binding
      in the BUL entry and release all resources associated with the MN
      IPv4 HoA binding.  In this case, the mobile node MUST send a
      Binding Revocation Acknowledgement message with the Status field
      is set to "success".  On the other hand, if the IPv4 Home Address
      Option was NOT included in the received BRI with the (V) bit set,
      the MN SHOULD send a Binding Revocation Acknowledgement message
      with the Status field set to "IPv4 Home Address Option Required".
      Additionally, if the IPv4 HoA received in the IPv4 Home Address
      Option is NOT the one assigned to the mobile node, the mobile node
      SHOULD send a Binding Revocation Acknowledgement with the status
      field set to "Binding Does NOT Exist".

   o  The mobile node MUST verify that the (P) bit in the Binding
      Revocation Indication is NOT set.  If the (P) bit is set, the
      mobile node MUST silently discard the Binding Revocation
      Indication message.

   o  If the mobile node has registered multiple care-of addresses with
      its home agent, the mobile node MUST verify which binding is being
      revoked by examining the content of the Binding Revocation
      Indication message.  If the mobile node received a Binding
      Revocation Indication with a single or more than one BID options
      and its home address is included in the Type 2 routing header, the
      mobile node MUST consider all of the care-of address(es)
      binding(s), identified in the BID options, with this home address
      are being revoked.

   o  If the mobile node has multi Care-of Address bindings with its
      home agent and received a Binding Revocation Indication, without
      any BID option included and its home address was included in the
      Type 2 routing header, the mobile node MUST consider all of its
      registered care-of addresses bindings with this home address are
      being revoked.


   The Revocation Trigger field value in the received Binding Revocation



Muhanna, et al.         Expires February 16, 2010              [Page 36]

Internet-Draft    Binding Revocation for IPv6 Mobility       August 2009


   Indication could be used by the mobile node to define what action the
   mobile node could do to be able to register again and receive its IP
   mobility service, e.g., contacting its home operator.

11.2.  Sending Binding Revocation Acknowledgement

   When the mobile node receives a Binding Revocation Indication from
   its home agent, the mobile node processes the received Binding
   Revocation Indication as in Section 11.1.  If the mobile node is
   required to send a Binding Revocation Acknowledgement message in
   response to the received Binding Revocation Indication, the mobile
   node sends a packet to its home agent containing a Binding Revocation
   Acknowledgement according to the procedure in Section 7.1 and the
   following:

   o  The mobile node MUST set the Status field to an appropriate value.
      The mobile node sets the Status field to success to reflect that
      it has received the Binding Revocation Indication and acknowledge
      that its IP connectivity with its home agent has been revoked.

   o  The destination IP address of the IPv6 packet of the Binding
      Revocation Acknowledgement is set to the source IP address of the
      received IPv6 packet of the Binding Revocation Indication.  The
      Mobile Node MUST include its home address in the Home Address
      Destination Option.


12.  Protocol Configuration Variables

   Any mobility entity which is allowed to invoke the binding revocation
   procedure by sending a Binding Revocation Indication message SHOULD
   allow the following variables to be configured.

   BRI Maximum Number of Retries (BRIMaxRetriesNumber)

      This variable specifies the maximum Number of times a mobility
      entity can retransmit a Binding Revocation Indication message
      before receiving a Binding Revocation Acknowledgement message.
      The default value for this parameter is 1.

   Initial Minimum Delay Between BRI messages (InitMINDelayBRIs)

      This variable specifies the initial delay timeout in seconds
      before the revoking mobility entity retransmits a BRI message.
      The default is 1 second but not less than 0.5 seconds.






Muhanna, et al.         Expires February 16, 2010              [Page 37]

Internet-Draft    Binding Revocation for IPv6 Mobility       August 2009


   Maximum BRA TIMEOUT (MAX_BRACK_TIMEOUT)

      This variable specifies the maximum delay timeout in seconds
      before the revoking mobility entity retransmits a BRI message.
      The default is 2 seconds.


13.  IANA Considerations

   This specification defines a new Binding Revocation Message using a
   new Mobility Header Type <IANA-TBD>, as described in Section 6.  The
   new Mobility Header type value needs to be assigned from the same
   numbering space as allocated for the other Mobility Header types.

   This document also creates a new name space "Binding Revocation Type"
   which indicates the type of the binding revocation message.  The
   current binding revocation message types are described in Section 6.1
   and Section 6.2, and are the following:

       0  Reserved
       1  Binding Revocation Indication
       2  Binding Revocation Acknowledgement
       All other values are reserved


   Future values of the Binding Revocation Type can be allocated using
   Standards Action or IESG Approval [RFC5226].

   In addition, this document also creates a second new namespace for
   the Revocation Trigger which indicates the reason behind sending the
   Binding Revocation Indication message.  The current Revocation
   Trigger values are described in Section 6.1, and are the following:

   Reserved and Per-MN Revocation Trigger Values:
       0  Reserved
       1  Unspecified
       2  Administrative Reason
       3  Inter-MAG Handover - same Access Type
       4  Inter-MAG Handover - different Access Type
       5  Inter-MAG Handover - Unknown
       6  User Initiated Session(s) Termination
       7  Access Network Session(s) Termination
       8  Possible Out-of Sync BCE State
       250-255 Reserved For Testing Purposes only







Muhanna, et al.         Expires February 16, 2010              [Page 38]

Internet-Draft    Binding Revocation for IPv6 Mobility       August 2009


       All other values are Reserved

   Global Revocation Trigger Values:
       128  Per-Peer Policy
       129  Revoking Mobility Node Local Policy

   Future values of the Revocation Trigger can be allocated using
   Standards Action or IESG Approval [RFC5226].

   Furthermore, this document creates a third new name space "Status
   Code" for the Status field in the Binding Revocation Acknowledgement
   message.  The current values are described in Section 6.2, and are
   the following:

       0  success
       1  partial success
       128  Binding Does NOT Exist
       129  IPv4 Home Address Option Required
       130  Global Revocation NOT Authorized
       131  Revoked Mobile Nodes Identity Required
       132  Revocation Failed - MN is Attached
       133  Revocation Trigger NOT Supported
       134  Revocation Function NOT Supported

   Future values of the Status field can be allocated using Standards
   Action or IESG Approval [RFC5226].

   All fields labeled "Reserved" are only to be assigned through
   Standards Action or IESG Approval.


14.  Security Considerations

   The protocol described here uses the same security association
   between the mobile node and the home agent or the mobile access
   gateway and the local mobility anchor that has been used to exchange
   the corresponding MIPv6 or PMIPv6 Binding Update and Binding
   Acknowledgement when the session was established.  If IPsec is used,
   the SPD of this IPsec SA MUST allow the MH type for the Binding
   Revocation Message defined in this document.

   However, in the case when the mobile access gateway sends a Binding
   Revocation Indication message with the Global (G) bit is set and the
   Revocation Trigger field is set to "Per-Peer policy", the local
   mobility anchor MUST verify that the mobile access gateway is
   authorized to use Per-Peer Global Revocation.





Muhanna, et al.         Expires February 16, 2010              [Page 39]

Internet-Draft    Binding Revocation for IPv6 Mobility       August 2009


15.  Acknowledgements

   The authors would like to thank Ryuji Wakikawa, Bruno Mongazon-
   Cazavet, Domagoj Premec, Arnaud Ebalard, Patrick Stupar, Vijay
   Devarapalli, and Joel Hortelius for their review and comments of this
   draft and all colleagues who have supported the advancement of this
   draft effort.


16.  References

16.1.  Normative References

   [RFC2119]  Bradner, S., "Key words for use in RFCs to Indicate
              Requirement Levels", BCP 14, RFC 2119, March 1997.

   [RFC5226]  Narten, T. and H. Alvestrand, "Guidelines for Writing an
              IANA Considerations Section in RFCs", BCP 26, RFC 5226,
              May 2008.

   [RFC3775]  Johnson, D., Perkins, C., and J. Arkko, "Mobility Support
              in IPv6", RFC 3775, June 2004.

   [RFC4283]  Patel, A., Leung, K., Khalil, M., Akhtar, H., and K.
              Chowdhury, "Mobile Node Identifier Option for Mobile IPv6
              (MIPv6)", RFC 4283, November 2005.

   [RFC5213]  Gundavelli, S., Leung, K., Devarapalli, V., Chowdhury, K.,
              and B. Patil, "Proxy Mobile IPv6", RFC 5213, August 2008.

   [ID-PMIP6-IPv4]
              Wakikawa, R. and S. Gundavelli, "IPv4 Support for Proxy
              Mobile IPv6", draft-ietf-netlmm-pmip6-ipv4-support-14
              (work in progress), July 2009.

   [ID-MCoA]  Wakikawa, R., Devarapalli, V., Ernst, T., and K. Nagami,
              "Multiple Care-of Addresses Registration",
              draft-ietf-monami6-multiplecoa-14 (work in progress),
              May 2009.

   [RFC5555]  Soliman, H., "Mobile IPv6 Support for Dual Stack Hosts and
              Routers", RFC 5555, June 2009.


16.2.  Informative References

   [RFC3344]  Perkins, C., "IP Mobility Support for IPv4", RFC 3344,
              August 2002.



Muhanna, et al.         Expires February 16, 2010              [Page 40]

Internet-Draft    Binding Revocation for IPv6 Mobility       August 2009


   [RFC3543]  Glass, S. and M. Chandra, "Registration Revocation in
              Mobile IPv4", RFC 3543, August 2003.


Authors' Addresses

   Ahmad Muhanna
   Nortel
   2221 Lakeside Blvd.
   Richardson, TX  75082
   USA

   Email: amuhanna@nortel.com


   Mohamed Khalil
   Nortel
   2221 Lakeside Blvd.
   Richardson, TX  75082
   USA

   Email: mkhalil@nortel.com


   Sri Gundavelli
   Cisco Systems
   170 West Tasman Drive
   San Jose, CA  95134
   USA

   Email: sgundave@cisco.com


   Kuntal Chowdhury
   Starent Networks
   30 International Place
   Tewksbury, MA  01876
   USA

   Email: kchowdhury@starentnetworks.com











Muhanna, et al.         Expires February 16, 2010              [Page 41]

Internet-Draft    Binding Revocation for IPv6 Mobility       August 2009


   Parviz Yegani
   Juniper Networks
   1194 North Mathilda Avenue
   Sunnyvale, CA  94089
   USA

   Email: pyegani@juniper.net












































Muhanna, et al.         Expires February 16, 2010              [Page 42]


